Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: མི་སྐྱེ་བ་ཤེས་ཏེ། མི་སྐྱེ་བ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། མི་སྐྱེ་བ་ཤེས་པ་འགོག་པ་ཤེས། མི་སྐྱེ་བ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing no-birth, the knowledge of the origin as related to knowledge of no-birth, the knowledge of cessation as related to knowledge of no-birth, and the knowledge of the path that leads to cessation as related to knowledge of no-birth.’

source: མི་འཇིགས་པ་ཤེས་ཏེ། མི་འཇིགས་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། མི་འཇིགས་པ་ཤེས་པ་འགོག་པ་ཤེས། མི་འཇིགས་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing fearlessness, the knowledge of the origin as related to knowledge of fearlessness, the knowledge of cessation as related to knowledge of fearlessness, and the knowledge of the path that leads to cessation as related to knowledge of fearlessness.’

source: དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་བྱང་ཆུབ་ཀྱི་མཚན་ཉིད་ལ་ཡང་བྱ་ཞིང་། དེ་བཞིན་དུ་སོ་སོ་ཡང་དག་པར་རིག་པ་ལ་ཡང་བྱའོ། །
en: “The same thing applies to the characteristics of the awakening of the Thus-Gone One and the correct understandings.

source: དེ་བཞིན་གཤེགས་པའི་མཚན་ཉིད་ཤེས་ཏེ། དེ་བཞིན་གཤེགས་པའི་མཚན་ཉིད་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། དེ་བཞིན་གཤེགས་པའི་མཚན་ཉིད་ཤེས་པ་འགོག་པ་ཤེས། དེ་བཞིན་གཤེགས་པའི་མཚན་ཉིད་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing the characteristics of the Thus-Gone One, the knowledge of the origin as related to knowledge of the characteristics of the Thus-Gone One, the knowledge of cessation as related to knowledge of the characteristics of the Thus-Gone One, and the knowledge of the path that leads to cessation as related to knowledge of the characteristics of the Thus-Gone One.’

source: དེ་བཞིན་གཤེགས་པའི་གནས་པ་ཤེས་ཏེ། དེ་བཞིན་གཤེགས་པའི་གནས་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། དེ་བཞིན་གཤེགས་པའི་གནས་པ་ཤེས་པ་འགོག་པ་ཤེས། དེ་བཞིན་གཤེགས་པའི་གནས་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing the abodes of the Thus-Gone One, the knowledge of the origin as related to knowledge of the abodes of the Thus-Gone One, the knowledge of cessation as related to knowledge of the abodes of the Thus-Gone One, and the knowledge of the path that leads to cessation as related to knowledge of the abodes of the Thus-Gone One.’

source: དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་དབང་པོ་ལ་ཡང་བྱའོ། །ལུས་ཀྱི་ལས་ཤེས་པ་དང་། ངག་གི་ལས་ཤེས་པ་དང་། ཡིད་ཀྱི་ལས་མཐའ་ཡས་པ་ཤེས་ཏེ།
en: “The same thing applies to the faculties of the Thus-Gone One, as well as physical actions and verbal actions.

source: ཡིད་ཀྱི་ལས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། ཡིད་ཀྱི་ལས་ཤེས་པ་འགོག་པ་ཤེས། ཡིད་ཀྱི་ལས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing mental actions, the knowledge of the origin as related to knowledge of mental actions, the knowledge of cessation as related to knowledge of mental actions, and the knowledge of the path that leads to cessation as related to knowledge of mental actions.’

source: སྔོན་དུ་འགྲོ་བ་མཐའ་ཡས་པ་ཤེས་ཏེ། སྔོན་དུ་འགྲོ་བ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། སྔོན་དུ་འགྲོ་བ་ཤེས་པ་འགོག་པ་ཤེས། སྔོན་དུ་འགྲོ་བ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing the preceding, the knowledge of the origin as related to knowledge of the preceding, the knowledge of cessation as related to knowledge of the preceding, and the knowledge of the path that leads to cessation as related to knowledge of the preceding.’

source: རྗེས་སུ་འབྲང་བ་མཐའ་ཡས་པ་ཤེས་ཏེ། རྗེས་སུ་འབྲང་བ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། རྗེས་སུ་འབྲང་བ་ཤེས་པ་འགོག་པ་ཤེས། རྗེས་སུ་འབྲང་བ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ།
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing the subsequent, the knowledge of the origin as related to knowledge of the subsequent, the knowledge of cessation as related to knowledge of the subsequent, and the knowledge of the path that leads to cessation as related to knowledge of the subsequent.’

source: ཡོངས་སུ་ཉམ་པ་ཤེས་ཏེ། ཡོངས་སུ་ཉམ་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། ཡོངས་སུ་ཉམ་པ་ཤེས་པ་འགོག་པ་ཤེས། ཡོངས་སུ་ཉམ་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing decay, the knowledge of the origin as related to knowledge of decay, the knowledge of cessation as related to knowledge of decay, and the knowledge of the path that leads to cessation as related to knowledge of decay.’

source: ཐམས་ཅད་མཁྱེན་པ་ཤེས་ཏེ། ཐམས་ཅད་མཁྱེན་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། ཐམས་ཅད་མཁྱེན་པ་ཤེས་པ་འགོག་པ་ཤེས། ཐམས་ཅད་མཁྱེན་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing omniscience, the knowledge of the origin as related to knowledge of omniscience, the knowledge of cessation as related to knowledge of omniscience, and the knowledge of the path that leads to cessation as related to knowledge of omniscience.’

source: འདི་ནི་མི་ཤེས་པ་ཀུན་ཤེས་པར་བྱེད་པའི་དབང་པོ་ཞེས་བྱ་སྟེ།
en: “Such is the faculty that facilitates understanding of all that has not been understood .

source: དེ་བཞིན་གཤེགས་པ་མི་ཤེས་པ་ཀུན་ཤེས་པར་བྱེད་པའི་དབང་པོ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the faculty that facilitates understanding of all that has not been understood,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཀུན་ཤེས་པའི་དབང་པོ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the faculty of full knowledge.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་ཀུན་ཤེས་པའི་དབང་པོའི་གནས་ཤེས་པས་མེ་ལོང་ལྟ་བུར་གྱུར་པའི་དཀྱིལ་འཁོར་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, with his mastery of the faculty of full knowledge, the Thus-Gone One correctly understands everything as if he sees it in a mirror.

source: ཁྱིམ་བདག་འདི་ལྟ་སྟེ་དཔེར་ན།
en: Householder, for example,

source: སྐྱེས་བུའི་ལག་པས་མེ་ལོང་གི་དཀྱིལ་འཁོར་བཟུང་བར་གཟུགས་ཐམས་ཅད་སྣང་ངོ་། །
en: when a person looks into a mirror that they hold, all forms can appear in the mirror.

source: དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་ཀུན་ཤེས་པའི་དབང་པོའི་གནས་ཤེས་པ་དེས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་རབ་ཏུ་མཁྱེན་ཅིང་།
en: Likewise, the Thus-Gone One correctly understands the thoughts of all beings due to his mastery of the faculty of full knowledge.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་རབ་ཏུ་མཁྱེན་ཏེ
en: He correctly understands the faculties of all beings [so that he can declare,]

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་རྣོའོ། །
en: ‘These people have sharp faculties,

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་འབྲིང་ངོ་།
en: these people have mediocre faculties,

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་རྟུལ་ལོ། །
en: and these people have dull faculties.

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་མཆོག་ཏུ་རྣོ་བའོ། །
en: These people are the sharpest among those with the best faculties,

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་མཆོག་གི་འབྲིང་ངོ་། །
en: these people are mediocre among those with the best faculties,

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་མཆོག་གི་རྟུལ་བའོ། །
en: and these people are the dullest among those with the best faculties.

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་འབྲིང་གི་རྣོ་བའོ། །
en: These people are the sharpest among those with mediocre faculties,

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་འབྲིང་གི་འབྲིང་ངོ་། །
en: these people are mediocre among those with mediocre faculties,

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་འབྲིང་གི་རྟུལ་བའོ། །
en: and these people are the dullest among those with mediocre faculties.

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་རྟུལ་བའི་རྣོ་བའོ། །
en: These people are the sharpest among those with dull faculties,

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་རྟུལ་བོའི་འབྲིང་ངོ་། །
en: these people are mediocre among those with dull faculties,

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་རྟུལ་བའི་རྟུལ་བའོ། །
en: and these people are the dullest among those with dull faculties.

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་འདོད་ཆགས་ཀྱིས་ཉེ་བར་ཉོན་མོངས་པའོ། །
en: The faculties of these people are afflicted by desire,

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་ཞེ་སྡང་གིས་ཉེ་བར་ཉོན་མོངས་པའོ། །
en: the faculties of these people are afflicted by anger,

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་གཏི་མུག་གིས་ཉེ་བར་ཉོན་མོངས་པའོ། །
en: the faculties of these people are afflicted by delusion.

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་འདོད་ཆགས་དང་ཞེ་སྡང་གིས་ཉེ་བར་ཉོན་མོངས་པའོ། །
en: The faculties of these people are afflicted by desire and anger,

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་འདོད་ཆགས་དང་གཏི་མུག་གིས་ཉེ་བར་ཉོན་མོངས་པའོ། །
en: the faculties of these people are afflicted by desire and delusion,

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་ཞེ་སྡང་དང་འདོད་ཆགས་ཀྱིས་ཉེ་བར་ཉོན་མོངས་པའོ། །
en: the faculties of these people are afflicted by anger and desire,

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་ཞེ་སྡང་དང་གཏི་མུག་གིས་ཉེ་བར་ཉོན་མོངས་པའོ། །
en: the faculties of these people are afflicted by anger and delusion,

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་གཏི་མུག་དང་འདོད་ཆགས་ཀྱིས་ཉེ་བར་ཉོན་མོངས་པའོ། །
en: the faculties of these people are afflicted by delusion and desire,

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་གཏི་མུག་དང་ཞེ་སྡང་གིས་ཉེ་བར་ཉོན་མོངས་པའོ། །
en: the faculties of these people are afflicted by delusion and anger,

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་འདོད་ཆགས་དང་ཞེ་སྡང་དང་གཏི་མུག་གིས་ཉེ་བར་ཉོན་མོངས་པའོ། །
en: and the faculties of these people are afflicted by desire, anger, and delusion.

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་ཉེ་བར་ཉོན་མོངས་པའོ། །
en: The faculties of these people are afflicted

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་ཉེ་བར་ཉོན་མོངས་པ་མེད་པའོ། །
en: and the faculties of these people are not afflicted.

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་ཞི་བའོ། །
en: The faculties of these people are peaceful

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་མ་ཞི་བའོ། །
en: and the faculties of these people are not peaceful.

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་རབ་ཏུ་ཞི་བའོ། །
en: The faculties of these people are very peaceful

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་རབ་ཏུ་མ་ཞི་བའོ། །
en: and the faculties of these people are not at all peaceful.

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་རྙོག་པ་ཅན་ནོ། །
en: The faculties of these people are stained

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་རྙོག་པ་མེད་པའོ། །
en: and the faculties of these people are not stained.

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་དཀྲུགས་པའོ། །
en: The faculties of these people are disturbed

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་མ་དཀྲུགས་པའོ། །
en: and the faculties of these people are not disturbed.

source: འདི་དག་གི་དབང་པོ་ནི་གསལ་བའོ། །
en: The faculties of these people are alert

source: འདི་དག་གི་དབང་པོ་ནི་མི་གསལ་བའོ། །
en: and the faculties of these people are not alert.

source: འདི་དག་གི་དབང་པོ་ནི་གྲོལ་བའོ། །
en: The faculties of these people are liberated

source: འདི་དག་གི་དབང་པོ་ནི་མ་གྲོལ་བའོ། །
en: and the faculties of these people are not liberated.

source: འདི་དག་གི་དབང་པོ་ནི་རབ་ཏུ་གྲོལ་བའོ། །
en: The faculties of these people are fully liberated

source: འདི་དག་གི་དབང་པོ་ནི་རབ་ཏུ་མ་གྲོལ་བའོ། །
en: and the faculties of these people are not fully liberated.

source: འདི་དག་གི་དབང་པོ་ནི་བདེ་བའོ། །
en: The faculties of these people are happy

source: འདི་དག་གི་དབང་པོ་ནི་མི་བདེ་བའོ། །
en: and the faculties of these people are not happy.

source: འདི་དག་གི་དབང་པོ་ནི་མ་ཚང་བའོ། །
en: The faculties of these people are complete

source: འདི་དག་གི་དབང་པོ་ནི་མ་ཚང་བ་མེད་པའོ། །
en: and the faculties of these people are not complete.

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་དྲུག་ཆར་ཡོངས་སུ་ཚང་བའོ། །
en: The faculties of these people are one sixth complete

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་དྲུག་ཆར་ཡོངས་སུ་མ་ཚང་བའོ། །
en: and the faculties of these people are not one sixth complete.

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་ངེས་པའོ། །
en: The faculties of these people are certain

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་མ་ངེས་པའོ། །
en: and the faculties of these people are not certain.

source: སེམས་ཅན་འདི་དག་ནི་ཉན་ཐོས་ཀྱི་དབང་པོ་དང་ལྡན་པའོ། །
en: These people have the faculties of hearers,

source: སེམས་ཅན་འདི་དག་ནི་རང་སངས་རྒྱས་ཀྱི་དབང་པོ་དང་ལྡན་པའོ། །
en: these people have the faculties of solitary buddhas,

source: སེམས་ཅན་འདི་དག་ནི་དེ་བཞིན་གཤེགས་པའི་དབང་པོ་དང་ལྡན་པའོ། །
en: and these people have the faculties of the thus-gone ones.

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་འཁོར་བའི་སྤྱོད་པ་དང་ལྡན་པའོ། །
en: The faculties of these people possess actions of saṃsāra

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་མྱ་ངན་ལས་འདའ་བའི་སྤྱོད་པ་དང་ལྡན་པའོ། །
en: and the faculties of these people possess actions of nirvāṇa.

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་ཐུན་མོང་བའོ། །
en: The faculties of these people are common

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་ཐུན་མོང་མ་ཡིན་པའོ། །
en: and the faculties of these people are unique.

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་ཤིན་ཏུ་མགུ་བའོ། །
en: The faculties of these people are very joyful

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་ཤིན་ཏུ་མ་མགུ་བའོ། །
en: and the faculties of these people are not very joyful.

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་ཚིམ་པའོ། །
en: The faculties of these people are satisfied

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་མ་ཚིམ་པའོ། །
en: and the faculties of these people are not satisfied.

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་འཁྲུལ་བའོ། །
en: The faculties of these people are confused

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་མ་འཁྲུལ་པའོ། །
en: and the faculties of these people are not confused.

source: འདི་དག་གི་དབང་པོ་ནི་འཕྱར་བའོ། །
en: The faculties of these people are elevated

source: འདི་དག་གི་དབང་པོ་ནི་མ་འཕྱར་བའོ། །
en: and the faculties of these people are not elevated.

source: འདི་དག་གི་དབང་པོ་ནི་རྒྱས་པའོ། །
en: The faculties of these people are extensive

source: འདི་དག་གི་དབང་པོ་ནི་མ་རྒྱས་པའོ། །
en: and the faculties of these people are not extensive.

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་གཡེངས་པའོ། །
en: The faculties of these people are distracted

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་མ་གཡེངས་པའོ། །
en: and the faculties of these people are not distracted.

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་ཡངས་པའོ། །
en: The faculties of these people are vast

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་ཡངས་པ་མ་ཡིན་པའོ། །
en: and the faculties of these people are not vast.

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་དབུགས་འབྱིན་པའོ། །
en: The faculties of these people are relieved

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་དབུགས་འབྱིན་པ་མ་ཡིན་པའོ། །
en: and the faculties of these people are not relieved.

source: འདི་དག་གི་དབང་པོ་ནི་མགྱོགས་པའོ། །
en: The faculties of these people are swift

source: འདི་དག་གི་དབང་པོ་ནི་མི་མགྱོགས་པའོ། །
en: and the faculties of these people are not swift.

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་མྱུར་བའོ། །
en: The faculties of these people are quick

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་མྱུར་བ་མ་ཡིན་པའོ། །
en: and the faculties of these people are not quick.

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་རྒྱ་ཆེ་བའོ། །
en: The faculties of these people are extensive

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་རྒྱ་ཆེ་བ་མ་ཡིན་པའོ། །
en: and the faculties of these people are not extensive.

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་ངེས་པར་འབྱུང་བའོ། །
en: The faculties of these people are renunciate

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་ངེས་པར་འབྱུང་བ་མ་ཡིན་པའོ། །
en: and the faculties of these people are not renunciate.

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་ངེས་པར་འབྱེད་པའོ། །
en: The faculties of these people are insightful

source: སེམས་ཅན་འདི་དག་གི་དབང་པོ་ནི་ངེས་པར་འབྱེད་པ་མ་ཡིན་པ་སྟེ།
en: and the faculties of these people are not insightful.’

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཀུན་ཤེས་པའི་དབང་པོ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, this is how the Thus-Gone One correctly understands the faculty of full knowledge.

source: དེ་བཞིན་གཤེགས་པ་ཀུན་ཤེས་པའི་དབང་པོ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the faculty of full knowledge,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཀུན་ཤེས་པའི་དབང་པོ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of the faculty of full knowledge.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་རྒྱུ་གང་དང་རྐྱེན་གང་དག་གིས་ཀུན་ཤེས་པའི་དབང་པོ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པ། གལ་ཏེ་མི་རྟག་པར་རྗེས་སུ་ལྟ་བར་གནས་པའམ། གལ་ཏེ་སྡུག་བསྔལ་བར་རྗེས་སུ་ལྟ་བར་གནས་པ་ནས། དེ་བཞིན་དུ་སྦྱར་ཏེ་ཕྱིར་རྒོལ་བར་རྗེས་སུ་ལྟ་བར་གནས་པའི་བར་གྱི་རྒྱུ་དེ་དང་རྐྱེན་དེ་དག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, the Thus-Gone One correctly understands those causes and conditions that accomplish knowledge of the origin as related to knowledge of full knowledge, whether he considers impermanence, or whether he considers suffering, and so forth, up until . . . whether he considers opposition.

source: དེ་བཞིན་གཤེགས་པ་ཀུན་ཤེས་པའི་དབང་པོ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the origin as related to the faculty of full knowledge,

source: བསྐལ་པར་ལན་གསུང་ཞིང་། བསྐལ་པ་བརྒྱ་ནས་བསྐལ་པ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་བར་དག་ཏུ་ལན་གསུང་སྟེ། དེ་བཞིན་དུ་སྦྱར་ཏེ།
en: he can respond for an eon. He can respond for a hundred eons, and so forth, up until . . . an inexpressible number of inexpressible eons . . . and so forth, up until . . . .

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཀུན་ཤེས་པའི་དབང་པོ་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the faculty of full knowledge.

source: སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་སྡུག་བསྔལ་ལས་ཡོངས་སུ་ཐར་བར་བྱས་ནས་བདེ་བ་ལ་བཙུད་པ་ནི་ཀུན་ཤེས་པའི་དབང་པོ་ཤེས་པ་འགོག་པ་ཤེས་པ་སྟེ།
en: He has freed innumerable beings from suffering and established them in happiness. That is the knowledge of cessation as related to knowledge of the faculty of full knowledge.

source: དེ་ལ་ཤེས་པ་དང་། མཐོང་བ་དང་། གསལ་བ་དང་། མངོན་པར་རྟོགས་པ་དང་། ཡང་དག་པར་ཁོང་དུ་ཆུད་པ་དང་། མཁས་པ་གང་ཡིན་པ་འདི་ནི་ཀུན་ཤེས་པའི་དབང་པོ་ཤེས་པ་འགོག་པ་ཤེས་པ་ཞེས་བྱ་སྟེ
en: To know, see, perceive, realize, understand, and be skillful about this is called knowing cessation as related to knowledge of the faculty of full knowledge .

source: དེ་བཞིན་གཤེགས་པ་ཀུན་ཤེས་པའི་དབང་པོ་ཤེས་པ་འགོག་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of cessation as related to knowledge of the faculty of full knowledge,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཀུན་ཤེས་པའི་དབང་པོ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of the faculty of full knowledge.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་རྒྱུ་གང་དང་རྐྱེན་གང་དག་གིས་ཀུན་ཤེས་པའི་དབང་པོ་ཤེས་པ་ཡོངས་སུ་ཤེས། ཁོང་དུ་ཆུད། མངོན་སུམ་དུ་བྱས་པའི་འགོག་པ་གལ་ཏེ་རོ་མྱང་བ་མེད་པར་རྗེས་སུ་ལྟ་བར་གནས་པའམ། གལ་ཏེ་ཉེས་དམིགས་སུ་རྗེས་སུ་ལྟ་བར་གནས་པའམ། གལ་ཏེ་ངེས་པར་འབྱུང་བར་རྗེས་སུ་ལྟ་བར་གནས་པ་དེ། དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, the Thus-Gone One correctly understands the knowledge of cessation by which he knows, understands, and actualizes the knowledge of the faculty of full knowledge, whether he contemplates insipidity, or whether he contemplates shortcomings, or whether he contemplates deliverance.

source: དེ་བཞིན་གཤེགས་པ་ཀུན་ཤེས་པའི་དབང་པོ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the path that leads to cessation as related to knowledge of the faculty of full knowledge,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཀུན་ཤེས་པ་དང་ལྡན་པའི་དབང་པོ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the faculty that is endowed with full knowledge.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་དུ་ཉན་ཐོས་དང་རང་སངས་རྒྱས་དང་། དེ་བཞིན་གཤེགས་པ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་རྣམས་ཀྱི་མཛད་པ་དག་མཛད་པས་དད་པ་དང་། བརྩོན་འགྲུས་དང་། དྲན་པ་དང་། ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, the Thus-Gone One correctly understands the faith, diligence, mindfulness, absorption, and knowledge practiced by the hearers and the solitary buddhas, as well as the thus-gone ones who fully awaken to unexcelled, perfect buddhahood in all the worlds in the ten directions.

source: དེ་ལ་ཤེས་པ་དང་། མཐོང་བ་དང་། གསལ་བ་དང་། མངོན་པར་རྟོགས་པ་ནས་མཁས་པའི་བར་གང་ཡིན་པ་འདི་ནི་ཀུན་ཤེས་པ་དང་ལྡན་པའི་དབང་པོ་ཞེས་བྱའོ། །
en: To know, see, perceive, realize, understand, and be skillful about this is called knowing the faculty that is endowed with full knowledge .

source: ཁྱིམ་བདག་གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་རྒྱུན་དུ་ཞུགས་པའི་ཀུན་ཏུ་སྦྱོར་བ་གསུམ་སྤངས་པ་ལ་བྱ་བ་ཅི་ཡང་མེད་དོ་ཞེས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, moreover, the Thus-Gone One understands, ‘There is no longer anything to do with regard to abandoning the three fetters as related to the stream-enterers.’

source: ལན་ཅིག་ཕྱིར་འོང་བའི་འདོད་པའི་འདོད་ཆགས་དང་གནོད་སེམས་བསྲབས་པ་ལ་བྱ་བ་ཅི་ཡང་མེད་དོ་ཞེས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He understands, ‘There is no longer anything to do with regard to restraining the desire and ill will as related to the once-returners.’

source: ཕྱིར་མི་འོང་བའི་ཀུན་ཏུ་སྦྱོར་བ་ཐ་མའི་ཆ་དང་འཐུན་པ་ལྔ་དག་སྤངས་པ་ལ་བྱ་བ་ཅི་ཡང་མེད་དོ་ཞེས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He understands, ‘There is no longer anything to do with regard to abandoning the five fetters that accord with the lowest of the three realms as related to the non-returners.’

source: དགྲ་བཅོམ་པའི་ཀུན་ཏུ་སྦྱོར་བ་ཐམས་ཅད་སྤངས་པ་ལ་བྱ་བ་ཅི་ཡང་མེད་དོ་ཞེས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He understands, ‘There is no longer anything to do with regard to abandoning all fetters as related to the worthy ones.’

source: ཀུན་ཤེས་པ་དང་ལྡན་པའི་དབང་པོ་ནི་བྱས་པ་སོ་སོར་རྟོགས་ཅིང་མི་སྐྱེ་བ་སོ་སོར་རྟོགས་པ་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands that the faculty that is endowed with full knowledge perceives what has been created and what is unborn.

source: དེ་བཞིན་གཤེགས་པ་ཀུན་ཤེས་པ་དང་ལྡན་པའི་དབང་པོ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the faculty of full knowledge,

source: སྟོན་པ་མིག་དང་ལྡན་པས་བྱས་པ་ནད་འདྲར་མཁྱེན། །
en: “The insightful teacher knows actions to be like disease.

source: ཉོན་མོངས་ཐམས་ཅད་སྤངས་པས་དེ་ཡི་བསླབ་བྱ་མེད། །
en: As he has abandoned all afflictions, no training remains for him.

source: བསླབ་པ་ཀུན་ལ་བསླབས་པས་དེ་ཡི་བསླབ་བྱ་མེད། །
en: As he has completed all training, no training remains for him.

source: བྱ་བ་བྱས་པ་དེས་མཁྱེན་འདི་ལྟར་རྨོངས་པ་མེད། །
en: The knowledge of he who has done what was needed is free from delusion.

source: སྦྲུལ་གྱི་མཆེ་བ་བཅད་ཅིང་དུག་ཀུན་རྣམ་བཅོམ་པས། །སེམས་ཅན་གནོད་བྱར་མི་རུང་དུག་སོ་དངོས་མེད་པ། །
en: Since he has cut the snake’s fangs and neutralized all poison, He is unable to harm others and his fangs have become nonexistent.
